<template>
 <div class="settings">
   <div class="container">
    <div class="settings__wrapper">
     <div div class="settings__col">
      <grid-list
        @doList="doList"
        @doGrid="doGrid"/>
      </div>
      <main-category @select="selectCategory" :selected="selected" :categories="categories"/>
     </div>
    </div>
   </div>
<div class="catalog">
 <div class="container">
		<div class="catalog__items catalog__items_row"
        :class="{list: layout == 'list'}"
        >
			<catalog-item
                v-for="catalog in filteredProducts"
                :key="catalog.id"
                :catalog_data="catalog"
                isLayout
            />
		</div>

	</div>
</div>
</template>

<script>

import CatalogItem from './CatalogItem.vue';
import GridList from './Grid-List.vue';
import MainCategory from '@/components/category/MainCategory.vue';


export default {
 name: 'MainCatalog',

 components: {
    CatalogItem, GridList, MainCategory,

 },

 props: {

 },

  data() {
   return {
    layout: 'grid',
    selected: 'Все',
    sortedProducts: [],

     categories: [
        {
            name: 'Все',
            value: 'Все',
        },
        {
            name: 'Напитки',
            value: 'Напитки',
        },
        {
            name: 'Пищевые добавки',
            value: 'Пищевые добавки',
        },
    ],
   products: [
  {
   image: "5.png",
    name: "Черный кофе с тмином",
    desctiption: `<strong>Состав:</strong> заменитель сливок, порошок черного тмина, кофе растворимый.<br>
    <strong>Способ приготовления:</strong> бросить 1 чайную ложку смеси (5 грамм) в чашку, залить горячей водой (1/2 чашки), добавить по вкусу сахар, размешать и выпить.<br>
    <strong>Рекомендуется принимать:</strong> не более 2 чашек в день! Всего 20 порций на 10 дней.<br>
    <strong>Не рекомендуется:</strong> беременным а также лицам имеющим трансплантированные органы!<br>
    <strong>Описание:</strong> "ЧЕРНЫЙ ТМИН КОФЕ" широко известен в исласких странах, а само растение известно во всем мире уже многие века. Еще во времена фараонов они применялись для здоровья. Семена черного тмина были обнаружены в гробнице Тутанхамона, куда они были положены слугами фараона для употребления их в загробной жизни. Клеопатра также употребляла семена и масло черного тмина для косметических и лечебных целей. Да и в Древнем Риме «панацея» называли именно черный тмин. Черный тмин очень почитаем среди мусульман. Используется в восточной кулинарии и медицине многие столетия как одно из лучших средств против огромного количества заболеваний. Сам пророк Мухаммад (мир ему и благословение) говорил: "Сделайте черный тмин обязательным для себя, так как он содержит в себе исцеление от всех болезней кроме смерти». В книге «Медицина пророка» описаны высказывания и советы пророка касательно лечения и профилактики всевозможных болезней и черный тмин также упомянут в ней. Его даже называют растением пророка. Применение семян очень широкое. Масло семян этого растения используется в лечебных целях для приема внутрь и для наружного применения. Семена же стирают в порошок и добавляют в плов, чай, кофе, другие блюда.<br>
    "ЧЕРНЫЙ ТМИН КОФЕ" очень популярен на Востоке, где он продается в магазинах и заказывается в кафе и ресторанах. Принимая у посетителя заказ на чашку кофе, официант всегда спрашивает: кофе с тмином или без. По Вашему желанию повар ресторана добавляет порошок семян в напитки и любое другое блюдо. Теперь и мы можем предложить Вам этот напиток, который способствует укреплению иммунитета, снижению уровня холестерина в крови и кровеносного давления, способствует очищению организма от червей и глистов и усилению жизненного тонуса и работоспособности. Помогает стабилизировать температуру тела в жаркое время года. Может бытьрекомендован женщинам для усиления лактации. Это кофе могут принимать мужчины для повышения потенции, нормализации работы мочевой системы, а также при простатите. Восточные урологи очень часто прописывют своим пациентам масло тмина для приема внутрь и втирания его под мошонку при заболевании простатитом. Этот напиток благотворно влияет и на нервную систему и может снизить головные боли, понизить сахар в крови.`,
    price: '4500',
    category: 'Напитки',
   id: 1,
  },
  {
   image: "6.png",
   name: "Капсулы с маслом чёрного тмина",
   desctiption: `100% натуральные молотые семена чёрного тмина арабских сортов фармацевтического качества

«В Чёрном Тмине лекарство от каждой болезни, кроме Смерти…»

 (Из источников Пророческой Медицины мусульман)

«Многие люди, читая длинный список заболеваний, при лечении которых применяется Чёрный Тмин в его различных формах (масло, семена, капсулы с маслом или семенами), относятся к этому с недоверием. Но целебные свойства Чёрного Тмина реальны и они не кажутся настолько невозможными, как только каждый понимает, что все они происходят из одного источника – способности растения чудесным образом стабилизировать и усиливать иммунную систему организма…»

(Питер Шляйхер, известный немецкий иммунолог-исследователь)

Родиной этого ставшего легендарным растения является Восточное Средиземноморье, те земли Плодородного полумесяца, включая Египет, Благословенный Шам и Междуречье, о которых сказано много и подробно на страницах истории арабов и иже с ними праарабских народов. Именно в южной части современной Турции и на севере современной Сирии и стало много тысяч лет тому назад впервые возделываться это чудесное для человека растение. Чёрный Тмин находят и в гробницах фараонов, и в древних литературных и исторических источниках, как то в Шумерских Трактатах или в Библии (Ветхий Завет, Книга Исайи), и всё это на землях древних территорий государств Плодородного полумесяца. Именно поэтому, мы можем с уверенностью говорить, что Чёрный Тмин имеет древние арабские истоки культивирования и применения, и считается исконно арабским растением с очень давних доисторических времён…

<strong>Чёрный Тмин</strong> – это и благословенное растение из Пророческой Медицины Исламского Наследия, ставшее обязательным к применению людьми Мусульманской Уммы, благодаря указанию на это в Достоверных Хадисах. Именно в Пророческой Мусульманской Медицине Чёрный Тмин стал по-настоящему лекарством от всех болезней, а не простой лечебной пряностью из восточной кухни. Мусульмане-врачеватели раскрыли многие из тайн этого чудесного благословенного растения, однако и по сей день проблематика лечения Чёрным Тмином сложных и неизлечимых современной медициной болезней занимает самые лучшие и пытливые умы человечества. Практически каждый год мы слышим о всё новых и новых открытиях в области применения Чёрного Тмина для исцеления неисцелимого…

Это удивительное растение, поразившее своими свойствами весь учёный мир многих стран мира, имеет уникальный состав из сложных и простых высокоэффективных лечебных веществ и является, по сути, панацеей от многих сложных заболеваний и болезней из-за того, что может быстро и качественно восстанавливать иммунитет человека.

Когда начинает восстанавливаться ослабевший из-за недугов иммунитет, происходит и исцеление от даже самых тяжёлых болезней, таких как «рак» или «гепатит С». Очень важно проявить терпение и не забывать использовать Чёрный Тмин ежедневно вовремя, довести курс применения его до шести месяцев, если ставится цель исцелиться от, по-настоящему, тяжёлых или сложных болезней.

На сегодняшний день известно о более чем 250, входящих в состав семян Чёрного Тмина, веществ и соединений, многие из которых до сих пор практически не изучены современной наукой. Мы достоверно знаем об огромном содержании в Чёрном Тмине полиненасыщенных жирных кислот (до 65%), о высоком содержании полезных эфирных масел (до 3%) и о витамине Е, о более чем 50 веществах, выступающих в качестве катализаторов обменных процессов в человеческом организме. В состав семян Чёрного Тмина входят полезные природные спирты и горечи, дубильные вещества и различные макро- и микроэлементы, которых легко можно насчитать несколько десятков. И всё это в семенах одного единственного растения!

Чёрный Тмин, по-настоящему, помогает при самых разнообразных недугах и заболеваниях, и практически, нет той области в современной медицине, где нельзя бы было применить этот чудодейственный продукт. Мы предлагаем и Вам прикоснуться к этому многотысячелетнему наследию исцеления, к обретению здоровья телом и духом!

<strong>НАШ ПРОДУКТ «ЧЁРНЫЙ ТМИН» ПРИМЕНЯЕТСЯ ПРИ:</strong>

— плохом иммунитете и утрате жизненных сил, при потере веса и общей слабости;

— аллергии и аллергических заболеваниях;

— астме, синуситах и ринитах, болезнях вирусной и инфекционной природы;

— бронхитах, простудных заболеваниях и гриппе;

— сахарном диабете второго типа и болезнях надпочечников, при гормональных сбоях у обоих полов;

— экземе, нейродерматите и псориазе, кожных простых и сложных заболеваниях;

— эндокринных и онкологических заболеваниях различных типов у обоих полов;

— кишечных заболеваниях (изжоге, ощущении чрезмерной полноты в желудке, диарее, запорах, судорожных болях в области желудка, метеоризме);

— проблемах с пищеварением, полипах желудка и кишечника, воспалениях кишок, для выведения кишечных паразитов и токсинов из тела;

— болезнях печени и желчного пузыря, панкреатите, болезнях щитовидной железы;

— заболеваниях опорно-двигательного аппарата, костей и суставов, артритах и радикулитах;

— половых проблемах, гинекологических и урологических заболеваниях, простатите и болезнях мочевыводящих путей;

— нарушениях внимания и концентрации, болезнях нервной системы и при сильных стрессах;

— для улучшения защитных сил организма (иммунитета) и улучшения здоровья в целом у всех возрастов;

— отдельно рекомендуется спортсменам и всем тем, кто ведёт активный образ жизни и нуждается в дополнительной защите организма.

В целом, можно порекомендовать использовать продукт «ЧЁРНЫЙ ТМИН» как здоровым людям, так и тем, кто желает укрепить своё здоровье или вылечиться от уже существующих недугов.

Противопоказания: наличие в организме имплантированных органов органической природы (почек, печени, сердца и т.д.), индивидуальная непереносимость. Беременным и лицам, страдающим от заболеваний сложного аутоиммунного характера, следует перед употреблением обязательно проконсультироваться с лечащим или надзорным врачом во избежание ухудшения их состояния и обострения заболеваний.

<strong>Состав продукта:</strong> 100% натуральные молотые семена чёрного тмина арабских сортов фармацевтического качества.

<strong>Форма выпуска:</strong> твёрдые растительные капсулы 500 мг на растительной целлюлозной основе; капсулы изготовлены в соответствии с требованиями международного стандарта Халяль.

<strong>Дозировка:</strong> 1-2 капсулы три раза в день в профилактических целях (3-6 капсул в сутки); для активного лечения рекомендуется применять по 2-3 капсулы, применяемых в три приёма (6-9 капсул в сутки). Желательно употреблять капсулы до еды за 30-40 минут, запивая водой комнатной температуры, смешанной с небольшим количеством пчелиного мёда (при отсутствии аллергии на мёд). В случае, если у Вас наблюдаются расстройства слизистой от применения капсул в виде жидкого стула, или если Вы испытываете дискомфорт и тяжесть в желудке непосредственно сразу после их применения в течение первых 20-30 минут, то Вам рекомендуется употреблять капсулы в дальнейшем строго вместе с едой в самом конце трапезы, также запивая тёплой водой с мёдом или без него. Рекомендуемый срок приёма капсул составляет от трёх до шести месяцев, исходя из индивидуальных особенностей пациента и рекомендаций врача, при ежедневном трёхразовом употреблении, в год рекомендуется проходить до двух подобных курсов с обязательным перерывом между курсами в 1-1.5 месяца. Детская дозировка с 7 лет не более 1 капсулы 3 раза в день и общим сроком применения не более 3-6 месяцев, сообразно рекомендациям специалиста. Кормящим матерям рекомендуется использовать дозировку взрослую – по 1-2 капсулы три раза в день. И помните, что Ваше лечение должно проходить под строгим контролем Вашего лечащего или надзорного врача!

Хранить в сухом прохладном месте при температуре от +10 до +30 °C.

`,
    price: '3500',
    category: 'Пищевые добавки',
    id: 2,
  },
   {
   image: "3.png",
    name: "Капсулы масла чёрного тмина с витамином В12 ",
    desctiption: `100% натуральные молотые семена чёрного тмина арабских сортов фармацевтического качества

«В Чёрном Тмине лекарство от каждой болезни, кроме Смерти…»

 (Из источников Пророческой Медицины мусульман)

«Многие люди, читая длинный список заболеваний, при лечении которых применяется Чёрный Тмин в его различных формах (масло, семена, капсулы с маслом или семенами), относятся к этому с недоверием. Но целебные свойства Чёрного Тмина реальны и они не кажутся настолько невозможными, как только каждый понимает, что все они происходят из одного источника – способности растения чудесным образом стабилизировать и усиливать иммунную систему организма…»

(Питер Шляйхер, известный немецкий иммунолог-исследователь)

Родиной этого ставшего легендарным растения является Восточное Средиземноморье, те земли Плодородного полумесяца, включая Египет, Благословенный Шам и Междуречье, о которых сказано много и подробно на страницах истории арабов и иже с ними праарабских народов. Именно в южной части современной Турции и на севере современной Сирии и стало много тысяч лет тому назад впервые возделываться это чудесное для человека растение. Чёрный Тмин находят и в гробницах фараонов, и в древних литературных и исторических источниках, как то в Шумерских Трактатах или в Библии (Ветхий Завет, Книга Исайи), и всё это на землях древних территорий государств Плодородного полумесяца. Именно поэтому, мы можем с уверенностью говорить, что Чёрный Тмин имеет древние арабские истоки культивирования и применения, и считается исконно арабским растением с очень давних доисторических времён…

<strong>Чёрный Тмин</strong> – это и благословенное растение из Пророческой Медицины Исламского Наследия, ставшее обязательным к применению людьми Мусульманской Уммы, благодаря указанию на это в Достоверных Хадисах. Именно в Пророческой Мусульманской Медицине Чёрный Тмин стал по-настоящему лекарством от всех болезней, а не простой лечебной пряностью из восточной кухни. Мусульмане-врачеватели раскрыли многие из тайн этого чудесного благословенного растения, однако и по сей день проблематика лечения Чёрным Тмином сложных и неизлечимых современной медициной болезней занимает самые лучшие и пытливые умы человечества. Практически каждый год мы слышим о всё новых и новых открытиях в области применения Чёрного Тмина для исцеления неисцелимого…

Это удивительное растение, поразившее своими свойствами весь учёный мир многих стран мира, имеет уникальный состав из сложных и простых высокоэффективных лечебных веществ и является, по сути, панацеей от многих сложных заболеваний и болезней из-за того, что может быстро и качественно восстанавливать иммунитет человека.

Когда начинает восстанавливаться ослабевший из-за недугов иммунитет, происходит и исцеление от даже самых тяжёлых болезней, таких как «рак» или «гепатит С». Очень важно проявить терпение и не забывать использовать Чёрный Тмин ежедневно вовремя, довести курс применения его до шести месяцев, если ставится цель исцелиться от, по-настоящему, тяжёлых или сложных болезней.

На сегодняшний день известно о более чем 250, входящих в состав семян Чёрного Тмина, веществ и соединений, многие из которых до сих пор практически не изучены современной наукой. Мы достоверно знаем об огромном содержании в Чёрном Тмине полиненасыщенных жирных кислот (до 65%), о высоком содержании полезных эфирных масел (до 3%) и о витамине Е, о более чем 50 веществах, выступающих в качестве катализаторов обменных процессов в человеческом организме. В состав семян Чёрного Тмина входят полезные природные спирты и горечи, дубильные вещества и различные макро- и микроэлементы, которых легко можно насчитать несколько десятков. И всё это в семенах одного единственного растения!

Чёрный Тмин, по-настоящему, помогает при самых разнообразных недугах и заболеваниях, и практически, нет той области в современной медицине, где нельзя бы было применить этот чудодейственный продукт. Мы предлагаем и Вам прикоснуться к этому многотысячелетнему наследию исцеления, к обретению здоровья телом и духом!

<strong>НАШ ПРОДУКТ «ЧЁРНЫЙ ТМИН» ПРИМЕНЯЕТСЯ ПРИ:</strong>

— плохом иммунитете и утрате жизненных сил, при потере веса и общей слабости;

— аллергии и аллергических заболеваниях;

— астме, синуситах и ринитах, болезнях вирусной и инфекционной природы;

— бронхитах, простудных заболеваниях и гриппе;

— сахарном диабете второго типа и болезнях надпочечников, при гормональных сбоях у обоих полов;

— экземе, нейродерматите и псориазе, кожных простых и сложных заболеваниях;

— эндокринных и онкологических заболеваниях различных типов у обоих полов;

— кишечных заболеваниях (изжоге, ощущении чрезмерной полноты в желудке, диарее, запорах, судорожных болях в области желудка, метеоризме);

— проблемах с пищеварением, полипах желудка и кишечника, воспалениях кишок, для выведения кишечных паразитов и токсинов из тела;

— болезнях печени и желчного пузыря, панкреатите, болезнях щитовидной железы;

— заболеваниях опорно-двигательного аппарата, костей и суставов, артритах и радикулитах;

— половых проблемах, гинекологических и урологических заболеваниях, простатите и болезнях мочевыводящих путей;

— нарушениях внимания и концентрации, болезнях нервной системы и при сильных стрессах;

— для улучшения защитных сил организма (иммунитета) и улучшения здоровья в целом у всех возрастов;

— отдельно рекомендуется спортсменам и всем тем, кто ведёт активный образ жизни и нуждается в дополнительной защите организма.

В целом, можно порекомендовать использовать продукт «ЧЁРНЫЙ ТМИН» как здоровым людям, так и тем, кто желает укрепить своё здоровье или вылечиться от уже существующих недугов.

Противопоказания: наличие в организме имплантированных органов органической природы (почек, печени, сердца и т.д.), индивидуальная непереносимость. Беременным и лицам, страдающим от заболеваний сложного аутоиммунного характера, следует перед употреблением обязательно проконсультироваться с лечащим или надзорным врачом во избежание ухудшения их состояния и обострения заболеваний.

<strong>Состав продукта:</strong> 100% натуральные молотые семена чёрного тмина арабских сортов фармацевтического качества с витамином b12.

<strong>Форма выпуска:</strong> твёрдые растительные капсулы 500 мг на растительной целлюлозной основе; капсулы изготовлены в соответствии с требованиями международного стандарта Халяль.

<strong>Дозировка:</strong> 1-2 капсулы три раза в день в профилактических целях (3-6 капсул в сутки); для активного лечения рекомендуется применять по 2-3 капсулы, применяемых в три приёма (6-9 капсул в сутки). Желательно употреблять капсулы до еды за 30-40 минут, запивая водой комнатной температуры, смешанной с небольшим количеством пчелиного мёда (при отсутствии аллергии на мёд). В случае, если у Вас наблюдаются расстройства слизистой от применения капсул в виде жидкого стула, или если Вы испытываете дискомфорт и тяжесть в желудке непосредственно сразу после их применения в течение первых 20-30 минут, то Вам рекомендуется употреблять капсулы в дальнейшем строго вместе с едой в самом конце трапезы, также запивая тёплой водой с мёдом или без него. Рекомендуемый срок приёма капсул составляет от трёх до шести месяцев, исходя из индивидуальных особенностей пациента и рекомендаций врача, при ежедневном трёхразовом употреблении, в год рекомендуется проходить до двух подобных курсов с обязательным перерывом между курсами в 1-1.5 месяца. Детская дозировка с 7 лет не более 1 капсулы 3 раза в день и общим сроком применения не более 3-6 месяцев, сообразно рекомендациям специалиста. Кормящим матерям рекомендуется использовать дозировку взрослую – по 1-2 капсулы три раза в день. И помните, что Ваше лечение должно проходить под строгим контролем Вашего лечащего или надзорного врача!

Хранить в сухом прохладном месте при температуре от +10 до +30 °C.
`,
    price: '4900',
    category: 'Пищевые добавки',
    id: 3,
  },
  {
   image: "4.png",
   name: "Капсулы Нижелла микс",
   desctiption: `<strong>Состав:</strong> Виноградной косточки масло, граната семян масло, черного тмина масло, инжира семян масло, абрикоса косточек масло<br>
    <strong>Описание:</strong> Нижелла Микс в капсулах состоит из 5 масел - это масло черного тмина, масло косточек винограда, масло косточек граната, масло косточек инжира и масло абрикосовых косточек. Концентрированный микс в капсулах ,30 капсул, это сильнейший антиоксидант, улучшает работу сердечно-сосудистой системы, пищеварительной системы, снижает свертываемость крови, тем самым помогает снижению артериального давления у пациентов с высоким давлением. Нижелла микс представлен в капсулах и в жидком виде. Действия одинаковые. Рекомендуется употреблять при кожных заболеваниях, климактерическом периоде, для улучшения гормональной системы. Нижелла миксы противопоказаны детям и беременным женщинам.`,
   price: '2500',
   category: 'Пищевые добавки',
    id: 4,
  },
  {
   image: "7.png",
   name: "Чай со вкусом абрикоса",
   desctiption: `<strong>Состав:</strong> чай с черным тмином<br>
        <strong>Описание:</strong> Помогает контролировать вес тела и чувство голода. Способствует сжиганию жира.<br>
        <strong>Состав:</strong> экстракт чёрного тмина, витамин С, экстракт гарциний, экстракт оливковых листьев, ароматизатор персика, мальтотодекстрин, экстракт зеленого чая.`,
   price: '3000',
   category: 'Напитки',
    id: 5,
  },
  {
   image: "8.png",
   name: "Масло черного тмина – 100 мл",
   desctiption: `<strong>Краткое описание:</strong>
        Масло способствует укреплению иммунитета и восстановлению баланса кишечной микрофлоры, нормализует работу пищеварительной системы, нейтрализует действие свободных радикалов и ускоряет их выведение из организма, положительно влияет на мышечную систему, повышая выносливость. Вкус масла крепкий, с горчинкой.<br>
        <strong>Показания:</strong>
        - Иммуностимуляция;
        - Укрепление функций организма.<br>
        <strong>Противопоказания:</strong>
        Индивидуальная непереносимость компонентов, беременность и лактация, наличие трансплантированных органов, детский возраст. После регулярного употребления в течение 2-х месяцев, рекомендуется сделать перерыв - 1 месяц.<br>
        <strong>Особые указания:</strong>
        Пищевая ценность на 100г: жиры - 99г.
        Энергетическая ценность на 100г: 900 ккал/3700 кДж.<br>
        <strong>Способ применения и дозировка:</strong>
        Ежедневное употребление масла черного тмина в чистом виде по 1 чайной ложке в день или, смешав с медом или соком по вкусу, благоприятно сказывается на функционировании организма в целом.<br>
        <strong>Состав:</strong>
        Масло черного тмина (Nigella Sativa Seed Oil.)`,
   price: '2000',
   category: 'Пищевые добавки',
    id: 6,
  },
  {
  image: "9.png",
   name: "Озоновые капсулы",
   desctiption: `<strong>Упаковка:</strong> 30 капсул.<br>
    <strong>Применение:</strong>	Рекомендовано по одной капсуле один раз в сутки.<br>
    <strong>Польза Озоновой Капсулы:</strong><br>
    1. Уничтожает бактерии, грибки и вирусы в организме.
    2. Активирует и балансирует системы восстановления организма.
    3. Увеличивает кислородную емкость крови в 2-10 раз.
    4. Активирует антиоксидантные системы в организме, снижает степень выраженности ПОЛ (перекисное окисление липидов).
    5. Ускоряет кровообращение в капиллярах, разжижая кровь.
    6. Стимулирует кроветворные системы.
    7. Предотвращает жировой гепатоз печени.
    8. Увеличивает выработку биологически активных веществ, таких как ферменты, которые снижают выработку в организме в результате старения.
    9. Снимает всю боль, включая хроническую боль в теле, с обезболивающим эффектом.
    10. Приводит кровоток к нормальным значениям, позволяет регулировать кровообращение путем расширения сосудов.
    11. Стабилизирует высокое кровяное давление в течение 2 ~ 10 дней после начала использования и поддерживает нормальный баланс.
    12. Лечит расстройства кровообращения, такие как варикозное расширение вен, и снимает боль.
    13. Уменьшает негативные последствия курения.
    14. Укрепляет и регулирует иммунную систему.
    15. Увеличивает количество кислорода в тканях.
    16. Регулирует щелочно-кислотный баланс крови.
    17. Увеличивает метаболизм клеток и позволяет утилизировать накопления клеточных отходов.
    18. Предотвращает закупорку сосудов, снижает уровень холестерина в мембране.
    19. Снижает уровень сахара в крови.
    20. Предотвращает образование скоплений тромбоцитов в крови.
    21. Предотвращает скопление микроба в крови.
    22. Увеличивает оксигенацию клеток мозга.
    23. Устраняет проблемы, вызванные забивание сосудов головного мозга (потеря равновесия, сильные головные боли, нарушения зрения и речи, потеря памяти).
    24. Повышает гормон счастья (эндорфин) и гормон молодости (мелатонин) в мозге.
    25. Увеличивая количество кислорода, которое он обеспечивает клеткам мозга, нейроны начинают генерировать избыточную энергию, усиливают обмен веществ, интенсифицируют связь друг с другом и улучшают качество. Поэтому он эффективен при болезнях Альцгеймера.`,
   price: '4000',
   category: 'Пищевые добавки',
    id: 7,
  },
  {
  image: "10.png",
   name: "Чай со вкусом лимона",
   desctiption: `<strong>В состав кофе входит:</strong>
    – экстракт черного тмина;
    – витамин С;
    – экстракт гарциний;
    – экстракт оливковых листьев;
    – ароматизатор лимона;
    – мальтодекстрин;
    – экстракт зеленого чая.
    Чай помогает контролировать вес, аппетит, уровень сахара в крови. Способствует сжиганию жира.`,
   price: '4000',
   category: 'Напитки',
    id: 7,
  },


 ],

    IsPopupVisible: false
  }
 },

     methods: {
        doList() {
            this.layout = 'list';
            this.isLayout = "list"
        },

        doGrid() {
            this.layout = 'grid';
            this.isLayout = "grid"
        },

        selectCategory(category) {
            this.sortedProducts = [];
            let vm = this;
            this.products.map(function (item) {
                if (item.category === category.name) {
                    vm.sortedProducts.push(item)
                }
            })
            this.selected = category.name
        },
    },

    computed: {
        filteredProducts() {
            if (this.sortedProducts.length) {
                return this.sortedProducts
            } else {
               return this.products
            }
        },
    },

};

</script>

<style lang="less">
// Documents =======================

.catalog {
    padding: 10px 0;
    background-color: #f8f9fa;
}

.documents__item {
    cursor: pointer;
    width: 20%;

    max-height: 370px;
    margin: 25px;

    @media (max-width: 860px) {
        margin: 10px;
    }

    @media (max-width: 760px) {
        width: 33.33333%;
    }
}

.documents__image {
    width: 100%;
    max-height: 100%;
}
</style>